sebanc/brunch/external-drivers/rtl8723du/core/rtw_wlan_util.c
inline bool rtw_bmp_not_empty(const u8 *bmp, u8 bmp_len)
{
	int i;

	for (i = 0; i < bmp_len; i++) {
		if (bmp[i])
			return 1;
	}

	return 0;
}

inline bool rtw_bmp_not_empty_exclude_bit0(const u8 *bmp, u8 bmp_len)
{
	int i;

	for (i = 0; i < bmp_len; i++) {
		if (i == 0) {
			if (bmp[i] & 0xFE)
				return 1;
		} else {
			if (bmp[i])
				return 1;
		}
	}

	return 0;
}

/* Check the id be set or not in map , if yes , return a none zero value*/
bool rtw_tim_map_is_set(struct adapter *adapt, const u8 *map, u8 id)
{
	return rtw_bmp_is_set(map, adapt->stapriv.aid_bmp_len, id);
}

/* Set the id into map array*/
void rtw_tim_map_set(struct adapter *adapt, u8 *map, u8 id)
{
	rtw_bmp_set(map, adapt->stapriv.aid_bmp_len, id);
}

/* Clear the id from map array*/
void rtw_tim_map_clear(struct adapter *adapt, u8 *map, u8 id)
{
	rtw_bmp_clear(map, adapt->stapriv.aid_bmp_len, id);
}

/* Check have anyone bit be set , if yes return true*/
bool rtw_tim_map_anyone_be_set(struct adapter *adapt, const u8 *map)
{
	return rtw_bmp_not_empty(map, adapt->stapriv.aid_bmp_len);
}

/* Check have anyone bit be set exclude bit0 , if yes return true*/
bool rtw_tim_map_anyone_be_set_exclude_aid0(struct adapter *adapt, const u8 *map)
{
	return rtw_bmp_not_empty_exclude_bit0(map, adapt->stapriv.aid_bmp_len);
}

struct adapter *dvobj_get_port0_adapter(struct dvobj_priv *dvobj)
{
	struct adapter *port0_iface = NULL;
	int i;
	for (i = 0; i < dvobj->iface_nums; i++) {
		if (get_hw_port(dvobj->adapters[i]) == HW_PORT0)
			break;
	}

	if (i < 0 || i >= dvobj->iface_nums)
		rtw_warn_on(1);
	else
		port0_iface = dvobj->adapters[i];

	return port0_iface;
}

struct adapter *dvobj_get_unregisterd_adapter(struct dvobj_priv *dvobj)
{
	struct adapter *adapter = NULL;
	int i;

	for (i = 0; i < dvobj->iface_nums; i++) {
		if (dvobj->adapters[i]->registered == 0)
			break;
	}

	if (i < dvobj->iface_nums)
		adapter = dvobj->adapters[i];

	return adapter;
}

struct adapter *dvobj_get_adapter_by_addr(struct dvobj_priv *dvobj, u8 *addr)
{
	struct adapter *adapter = NULL;
	int i;

	for (i = 0; i < dvobj->iface_nums; i++) {
		if (!memcmp(dvobj->adapters[i]->mac_addr, addr, ETH_ALEN))
			break;
	}

	if (i < dvobj->iface_nums)
		adapter = dvobj->adapters[i];

	return adapter;
}
